As Lyra Flynn rode her horse, Galen, across the rolling hills of Eldrida's countryside, she couldn't shake the feeling of unease that had been growing inside her for weeks. It wasn't just the usual tension that came with being a member of the elite guard, or even the worry about her mentor Arinna's mysterious illness. No, this was something different - a sense of foreboding that seemed to seep into her very bones. Lyra's piercing emerald eyes scanned the horizon, her hand instinctively reaching for the hilt of her sword. She had been away from the kingdom for months, and yet she couldn't help but feel that something was amiss.
As she crested a small hill, Lyra's gaze fell upon the familiar silhouette of Eldrida's capital city, its towers and spires glinting in the fading light of day. But something was off. The city's usual bustle and activity seemed subdued, the streets eerily quiet. Lyra's unease grew, her hand tightening around Galen's reins as she urged the horse forward. As they approached the city gates, Lyra spotted a group of guardsmen huddled in conversation, their faces grave. Her heart quickened as she dismounted Galen and approached them. "What's happening?" she demanded, her voice low and urgent. The guardsmen exchanged nervous glances before one of them spoke up, his voice barely above a whisper. "It's Arinna, Lyra. She's... she's not doing well."
Lyra's eyes widened in alarm as she pushed her way through the guardsmen, her mind racing with worst-case scenarios. She had been away from the kingdom for months, and yet she had been keeping a close eye on Arinna's condition through messengers and letters. But this... this was different. The guardsmen parted to reveal Arinna, her mentor and the legendary warrior-queen, lying pale and still on a makeshift bed of furs. Lyra's heart skipped a beat as she rushed to Arinna's side, her hand reaching out to touch the older woman's clammy forehead. "What happened?" she demanded, her voice shaking with worry. The guardsmen exchanged nervous glances again, before one of them spoke up. "We don't know, Lyra. She just... collapsed. We've been trying to reach you, but your messenger never made it back." Lyra's gaze narrowed, her mind racing with possibilities. She knew that Arinna was a powerful warrior, but even she wasn't invincible. And now, with the dark cult stirring in the shadows... Lyra's grip on Arinna's hand tightened, her determination to uncover the truth and save her mentor burning brighter than ever.
As Lyra's eyes locked onto Arinna's pale face, she felt a surge of determination course through her veins. She had always been fiercely loyal to Arinna, and the thought of losing her mentor was unbearable. Lyra's gaze swept the makeshift bedchamber, her mind racing with possibilities. She knew that Arinna's illness was no ordinary affliction, and the dark cult's involvement seemed more likely than ever. With a fierce resolve, Lyra turned to the guardsmen. "I need to see Arinna's healers," she demanded, her voice firm and commanding. "I want to know what's happening, and I need it now." The guardsmen nodded, their faces grave with worry. "We've already sent for them, Lyra. They'll be here soon."